app/views/users/_merchant_form.html.erb

SELECT "categories".* FROM "categories"
---
                                <%= f.label :price, "Product Category" %>
                                <%= f.collection_select :category_id, Category.all, :id, :name, {prompt: "Select Category"}, class: 'form-control', required: true %>