app/views/users/show.html.erb

SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 9]]
---
                                        <% end %>
                                        <p class="proile-rating">NO. OF ORDERS : <span><%= current_user.orders.count %></span></p>