app/views/orders/show.html.erb


      <% if !current_user.orders.pluck('ref_number').include?(@order.ref_number) %>
---
SELECT "orders"."ref_number" FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 9]]

            <tbody>
              <% for item in @order.order_details %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]