app/helpers/application_helper.rb

SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?) ORDER BY "products"."id" ASC LIMIT ?  [["id", 1], ["id", 2], ["LIMIT", 1]]
---
    def cart_details
        product_ids = session[:cart].nil? ? nil : session[:cart].keys
        cart_items = Product.where(id: product_ids).all