app/controllers/orders_controller.rb

  def create
    order = current_user.orders.build(order_params)

    if order.save
---
INSERT INTO "orders" ("user_id", "ref_number", "address", "state", "created_at", "updated_at", "first_name", "last_name", "phone", "email", "lga") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @order = Order.find_by(ref_number: params[:ref])
---
SELECT "orders".* FROM "orders" WHERE "orders"."ref_number" = ? LIMIT ?  [["ref_number", 636587], ["LIMIT", 1]]

  def rand_num
    num = rand(111111...999999)
    while Order.exists?(ref_number: num)
---
SELECT 1 AS one FROM "orders" WHERE "orders"."ref_number" = ? LIMIT ?  [["ref_number", 451026], ["LIMIT", 1]]