app/controllers/products_controller.rb

INSERT INTO "products" ("name", "merchant_id", "size", "image_data", "description", "num_available", "created_at", "updated_at", "price", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    product = current_user.products.build(product_params)

    if product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 4]]
---
  def destroy
    if Product.exists?(id: params[:id])
      product = Product.find(params[:id])
      product.destroy