app/models/order.rb

  def save_details(details, session)
    details.each do |item|
      detail = self.order_details.build(product_id: item.id, quantity: session[item.id.to_s].to_i)
      detail.save
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
INSERT INTO "order_details" ("order_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_id", 13], ["product_id", 1], ["quantity", 2], ["created_at", "2021-07-23 14:44:17.929623"], ["updated_at", "2021-07-23 14:44:17.929623"]]