app/views/products/index.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ?  [["category_id", 3]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ?  [["category_id", 2]]
---
                  <ul>
                    <li class="filter-list"><input class="pixel-radio" type="radio" id="men" name="brand"><label for="men">Men<span> (<%= Category.find(1).products.count %>)</span></label></li>
                    <li class="filter-list"><input class="pixel-radio" type="radio" id="women" name="brand"><label for="women">Women<span> (<%= Category.find(2).products.count %>)</span></label></li>
                    <li class="filter-list"><input class="pixel-radio" type="radio" id="accessories" name="brand"><label for="accessories">Children<span> (<%= Category.find(3).products.count %>)</span></label></li>

SELECT "products"."id" FROM "products" WHERE "products"."merchant_id" = ?  [["merchant_id", 10]]
---

                    <% if current_user && (current_user.merchant && current_user.products.pluck('id').include?(product.id)) %>